Revit 2024 API
WireConduitTypeSet Constructor
Initializes a new instance of the WireConduitTypeSet class
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireConduitTypeSet()
Visual Basic
Public Sub New
Visual C++
public:
WireConduitTypeSet()
See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace